'''
 В нас список [1, 2, 3, 4, 5, 6, 7, 8, 9]
 потрібно неаписати функцію, яка буде проходити по цьому списку та
 виводити лише непарні числа
'''


def only_even_numbers(numbers_list):
    # Пройтися по усім числам
    for number in numbers_list:
        # Перевірити чи конкретне число є парним чи ні
        if number % 2 == 0:
            # Якщо не парне, то вивести у термінал
            print(number)


numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9]
only_even_numbers(numbers)

## Парні числа
# 2 4 6 8 10 12 14 16
## Непарні числа
# 1 3 5 7 9 11 13 15 17

# 10 / 5
# 2 * 5

# 3 / 2
# 2 * 1 + 1

# 4 / 2
# 2 * 2 + 0
